LuaVan/Luan_van/src/Tasks/ProgramApprovalTasks/ProgramApprovalTasks.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>ProgramApprovalTasks</name>
  <addressingAttributes>
    <name>Performer</name>
    <type>
      <types>CatalogRef.Lecturers</types>
    </type>
  </addressingAttributes>
</mdclass:Task>

LuaVan/Luan_van/src/Documents/ProgramApproval/ProgramApproval.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ProgramApproval</name>
  <registerRecords>InformationRegister.ProgramValidity</registerRecords>
  <attributes>
    <name>TargetProgram</name>
    <type>
      <types>CatalogRef.TrainingPrograms</types>
    </type>
  </attributes>
  <attributes>
    <name>ApprovalLevel</name>
    <type>
      <types>EnumRef.ApprovalLevel</types>
    </type>
  </attributes>
  <attributes>
    <name>BasedOnProposal</name>
    <type>
      <types>DocumentRef.ProgramProposal</types>
    </type>
  </attributes>
  <attributes>
    <name>CouncilSession</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Decision</name>
    <type>
      <types>EnumRef.ApprovalDecision</types>
    </type>
  </attributes>
  <attributes>
    <name>RevisionNotes</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>IssuanceDecision</name>
    <type>
      <types>CatalogRef.Decisions</types>
    </type>
  </attributes>
  <attributes>
    <name>SignerSummary</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>EnumRef.ProgramStatuses</types>
    </type>
  </attributes>
  <tabularSections>
    <name>VotingResults</name>
    <attributes>
      <name>CouncilMember</name>
      <type>
        <types>CatalogRef.Lecturers</types>
      </type>
    </attributes>
    <attributes>
      <name>Vote</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Comment</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

LuaVan/Luan_van/src/Catalogs/Decisions/Decisions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Decisions</name>
  <attributes>
    <name>IssueDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Signer</name>
    <type>
      <types>CatalogRef.Lecturers</types>
    </type>
  </attributes>
  <attributes>
    <name>EffectiveDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DecisionFile</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

LuaVan/Luan_van/src/Tasks/ProgramApprovalTasks/Forms/ItemForm/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	// Ẩn command CreateDecisions nếu user không thuộc AcademicAffairsOffice (PĐT)
	If Not CurrentUserHasRole("AcademicAffairsOffice") Then
		If Items.Find("FormCreateDecisions") <> Undefined Then
			Items.FormCreateDecisions.Visible = False;
		EndIf;
	EndIf;
EndProcedure

&AtServer
Function CurrentUserHasRole(RoleName)
	User = InfoBaseUsers.CurrentUser();
	If User = Undefined Then
		Return False;
	EndIf;
	// FullAccess / SystemAdmin coi như có tất cả role
	FullAccess = Metadata.Roles.Find("FullAccess");
	If FullAccess <> Undefined And User.Roles.Contains(FullAccess) Then
		Return True;
	EndIf;
	SysAdmin = Metadata.Roles.Find("SystemAdmin");
	If SysAdmin <> Undefined And User.Roles.Contains(SysAdmin) Then
		Return True;
	EndIf;
	RoleMeta = Metadata.Roles.Find(RoleName);
	If RoleMeta = Undefined Then
		Return False;
	EndIf;
	Return User.Roles.Contains(RoleMeta);
EndFunction

&AtClient
Procedure CreateApprovalDoc(Command)
	OpenApprovalFromTask();
EndProcedure

&AtServer
Function GetContext()
	Return WorkflowAddressing.GetApprovalContextFromTask(Object.Ref);
EndFunction

&AtClient
Procedure OpenApprovalFromTask()
	Ctx = GetContext();
	If Ctx.TargetProgram.IsEmpty() Then
		ShowMessageBox(, "Nhiệm vụ này chưa gắn với CTĐT cụ thể, không thể tạo phê duyệt.");
		Return;
	EndIf;
	FillingValues = New Structure;
	FillingValues.Insert("TargetProgram", Ctx.TargetProgram);
	FillingValues.Insert("ApprovalLevel", Ctx.ApprovalLevel);
	OpenForm("Document.ProgramApproval.ObjectForm",
		New Structure("FillingValues", FillingValues),
		ThisObject);
EndProcedure

&AtClient
Procedure CreateDecisions(Command)
	OpenDecisionFromTask();
EndProcedure

&AtServer
Function GetDecisionFillingValues()
	Result = New Structure;
	Ctx = WorkflowAddressing.GetApprovalContextFromTask(Object.Ref);
	If Ctx.TargetProgram.IsEmpty() Then
		Return Result;
	EndIf;

	Program = Ctx.TargetProgram;

	// Description = "Quyết định ban hành CTĐT [Tên CTĐT]"
	Result.Insert("Description", "Quyết định ban hành CTĐT " + String(Program));

	// IssueDate = today, EffectiveDate = today + 30 ngày (mặc định)
	Today = CurrentSessionDate();
	Result.Insert("IssueDate", Today);
	Result.Insert("EffectiveDate", Today);

	// Signer = Giám đốc (Role=Dean)
	Result.Insert("Signer", WorkflowAddressing.FindDean());

	Return Result;
EndFunction

&AtClient
Procedure OpenDecisionFromTask()
	FillingValues = GetDecisionFillingValues();
	If FillingValues.Count() = 0 Then
		ShowMessageBox(, "Nhiệm vụ này chưa gắn với CTĐT cụ thể, không thể tạo Quyết định ban hành.");
		Return;
	EndIf;
	OpenForm("Catalog.Decisions.ObjectForm",
		New Structure("FillingValues", FillingValues),
		ThisObject);
EndProcedure
